.src/FrontEnd/b_what_is_javascript.org
#+TITLE: JavaScript (ECMAScript)



* 历史
** 浏览器发展史

1. 网景浏览器
2. IE 浏览器
3. Chrome 浏览器

** JavaScript 发展史

1. JavaScript
2. ES5
3. ES6
4. Node.js

** 参考网站

- https://developer.mozilla.org/zh-CN/docs/Web/JavaScript

* 示例 (Hello World)

https://developer.mozilla.org/zh-CN/docs/Learn/JavaScript/First_steps/What_is_JavaScript

#+begin_src html
  <!DOCTYPE html>
  <html lang="en">
  <head>
      <meta charset="UTF-8">
      <meta name="viewport" content="width=device-width, initial-scale=1.0">
      <title>first blood</title>
      <style>
          .xiaoming {
              font-size: 30pt;
              font-family: 宋体;
              font-weight: 400; 
              color:red
          }
      </style>
      <script type="text/javascript">
          function bianyanse () {
              var new_name = prompt("请输入您想要的名字!");
              xiaoming.style.color = "green";
              xiaoming.style.background = "red";
              xiaoming.innerText = new_name;
          }
      </script>
  </head>
  <body>
      示例:
      <p>
          <span id="xiaoming"
           class="xiaoming"
           onclick="bianyanse()">小明</span>是个好同学。
      </p>
  </body>
  </html>
#+end_src

* 在浏览器中使用 JavaScript
** 内嵌在 html 代码中

可以在 html 文档的任意部位添加 JavaScript 代码:
#+begin_src html
  <head>
    <script>...</scirpt>
  <script>...</scirpt>
  </head>
  <body>
    <script>...</scirpt>
  <div>hello</div>
  <script>...</scirpt>
  </body>
#+end_src

只不过，一定要注意，JS 代码需要使用 script 标签包围:
#+begin_src html
  <!-- 这里存在的是 Html 代码，我是注释 -->
  <script type="text/javascript">
    // 这里存在的是完全的 JavaScript 代码
    // 使用 // 作为注释的开始
    var a = 2;
    alert(a);
  </script>

  <script>
    // ....
  </script>
#+end_src

另外:
- 如果 script 标签不闭合，会导致页面渲染出问题
- 浏览器渲染 html 是从上到下的，所以，前面的 script 会比后面的先执行
- 一个页面中可以有多个 script 块
- 一般来说，会将 script 放到 head 中，但是为了渲染速度，很多时候，会放到 body 的最后

** 作为外部的 JS 文件存在

引入外部 JavaScript 脚本的语法:
#+begin_src html
  <!-- 加载 html 文件相同目录的 hello.js 文件 -->
  <script src="hello.js"></script>
  <script src="./hello.js"></script>

  <!-- /html/aaa/bbb/hello.html -->
  <!-- /html/js/hello.js -->
  <!-- 错误的示例： /html/hello.html -->
  <script src="../../js/hello.js"></script>

  <!-- 绝对路径 -->
  <script src="/html/hello.js"></script>

  <!-- 一定注意，标签要闭合。先两种写法都是错误的 -->
  <script src="hello.js">
  <script src="hello.js"/>
#+end_src

也可以直接使用外部的链接作为 JS 脚本直接使用:
#+begin_src html
  <!doctype html>
  <html lang="en">
    <head>
      <meta charset="UTF-8"/>
      <title>引入外部的 JS</title>
      <script src="https://cdn.bootcdn.net/ajax/libs/jquery/3.5.1/jquery.min.js"></script>
    </head>
    <body>
      <script>
       alert($);
      </script>
    </body>
  </html>
#+end_src

** [示例] 创建一个网页，点击按钮刷新节点的时间

首先，创建一个网页 aaa.html，确定其中的「内容」和「结构」:
#+begin_src html
  <html lang="en">
    <head>
      <meta charset="UTF-8"/>
      <title>Time</title>
    </head>
    <body>
      现在时间是:
      <p id="time_node">No time now</p>
      <button id="time_button">刷新时间</button>
    </body>
  </html>
#+end_src

其次，添加样式，使用外部 css 文件 aaa.css:
#+begin_src css
  p { 
      color: red;
  }
#+end_src

然后，添加交互逻辑，使用外部 JavaScript 文件 aaa.js:
#+begin_src js
  function showTime () {
      node_time.innerText = new Date();
  }
  node_button = showTime;
#+end_src

最后，确保将 aaa.css 和 aaa.js 添加到 html 中。要注意添加的位置:
#+begin_src html
  ...
  <link rel="stylesheet" href="hello.css">
  ...
  <script src="hello.js"></script>
  ...
#+end_src

-----------------------

上述就是编写一个网页的基本流程。

将「样式」和「交互逻辑」从页面中 分离 出来，这样结构更加分明，
方便分工协作，而且有益于维护和重构。


