bk_html/FrontEnd/b_what_is_javascript.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-10-28 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>JavaScript (ECMAScript)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">JavaScript (ECMAScript)</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf6963a6">1. 历史</a>
<ul>
<li><a href="#orgee03189">1.1. 浏览器发展史</a></li>
<li><a href="#org957680d">1.2. JavaScript 发展史</a></li>
<li><a href="#org5c0b4c0">1.3. 参考网站</a></li>
</ul>
</li>
<li><a href="#org3ab48fc">2. 示例 (Hello World)</a></li>
<li><a href="#orgb48ce5a">3. 在浏览器中使用 JavaScript</a>
<ul>
<li><a href="#orgc560a5e">3.1. 内嵌在 html 代码中</a></li>
<li><a href="#org6ec6943">3.2. 作为外部的 JS 文件存在</a></li>
<li><a href="#org1302d04">3.3. [示例] 创建一个网页，点击按钮刷新节点的时间</a></li>
</ul>
</li>
</ul>
</div>
</nav>



<section id="outline-container-orgf6963a6" class="outline-2">
<h2 id="orgf6963a6"><span class="section-number-2">1</span> 历史</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgee03189" class="outline-3">
<h3 id="orgee03189"><span class="section-number-3">1.1</span> 浏览器发展史</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>网景浏览器</li>
<li>IE 浏览器</li>
<li>Chrome 浏览器</li>
</ol>
</div>
</div>

<div id="outline-container-org957680d" class="outline-3">
<h3 id="org957680d"><span class="section-number-3">1.2</span> JavaScript 发展史</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>JavaScript</li>
<li>ES5</li>
<li>ES6</li>
<li>Node.js</li>
</ol>
</div>
</div>

<div id="outline-container-org5c0b4c0" class="outline-3">
<h3 id="org5c0b4c0"><span class="section-number-3">1.3</span> 参考网站</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/zh-CN/docs/Web/JavaScript">https://developer.mozilla.org/zh-CN/docs/Web/JavaScript</a></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org3ab48fc" class="outline-2">
<h2 id="org3ab48fc"><span class="section-number-2">2</span> 示例 (Hello World)</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://developer.mozilla.org/zh-CN/docs/Learn/JavaScript/First_steps/What_is_JavaScript">https://developer.mozilla.org/zh-CN/docs/Learn/JavaScript/First_steps/What_is_JavaScript</a>
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #a020f0;">!DOCTYPE</span> html&gt;
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">html</span> <span style="color: #a0522d;">lang</span>=<span style="color: #8b2252;">"en"</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">meta</span> <span style="color: #a0522d;">charset</span>=<span style="color: #8b2252;">"UTF-8"</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">meta</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"viewport"</span> <span style="color: #a0522d;">content</span>=<span style="color: #8b2252;">"width=device-width, initial-scale=1.0"</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">title</span><span style="color: #707183;">&gt;</span><span style="font-weight: bold; text-decoration: underline;">first blood</span><span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">title</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">style</span><span style="color: #707183;">&gt;</span>
        <span style="color: #0000ff;">.xiaoming </span><span style="color: #707183;">{</span>
            <span style="color: #a020f0;">font-size</span>: 30pt;
            <span style="color: #a020f0;">font-family</span>: &#23435;&#20307;;
            <span style="color: #a020f0;">font-weight</span>: 400;
            <span style="color: #a020f0;">color</span>:<span style="color: #ffffff; background-color: #ff0000;">red</span>
        <span style="color: #707183;">}</span>
    <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">style</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javascript"</span><span style="color: #707183;">&gt;</span>
        <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">bianyanse</span> <span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
            <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">new_name</span> = prompt<span style="color: #7388d6;">(</span><span style="color: #8b2252;">"&#35831;&#36755;&#20837;&#24744;&#24819;&#35201;&#30340;&#21517;&#23383;!"</span><span style="color: #7388d6;">)</span>;
            xiaoming.style.color = <span style="color: #8b2252;">"green"</span>;
            xiaoming.style.background = <span style="color: #8b2252;">"red"</span>;
            xiaoming.innerText = new_name;
        <span style="color: #707183;">}</span>
    <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">body</span><span style="color: #707183;">&gt;</span>
    &#31034;&#20363;:
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">p</span><span style="color: #707183;">&gt;</span>
        <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">span</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"xiaoming"</span>
         <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"xiaoming"</span>
         <span style="color: #a0522d;">onclick</span>=<span style="color: #8b2252;">"bianyanse()"</span><span style="color: #707183;">&gt;</span>&#23567;&#26126;<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">span</span><span style="color: #707183;">&gt;</span>&#26159;&#20010;&#22909;&#21516;&#23398;&#12290;
    <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">p</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">body</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">html</span><span style="color: #707183;">&gt;</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-orgb48ce5a" class="outline-2">
<h2 id="orgb48ce5a"><span class="section-number-2">3</span> 在浏览器中使用 JavaScript</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc560a5e" class="outline-3">
<h3 id="orgc560a5e"><span class="section-number-3">3.1</span> 内嵌在 html 代码中</h3>
<div class="outline-text-3" id="text-3-1">
<p>
可以在 html 文档的任意部位添加 JavaScript 代码:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #707183;">&lt;</span><span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>...&lt;/scirpt&gt;
&lt;script&gt;...&lt;/scirpt&gt;
&lt;/head&gt;
&lt;body&gt;
  &lt;script&gt;...&lt;/scirpt&gt;
&lt;div&gt;hello&lt;/div&gt;
&lt;script&gt;...&lt;/scirpt&gt;
&lt;/body&gt;
</pre>
</div>

<p>
只不过，一定要注意，JS 代码需要使用 script 标签包围:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#36825;&#37324;&#23384;&#22312;&#30340;&#26159; Html &#20195;&#30721;&#65292;&#25105;&#26159;&#27880;&#37322; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"text/javascript"</span><span style="color: #707183;">&gt;</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#36825;&#37324;&#23384;&#22312;&#30340;&#26159;&#23436;&#20840;&#30340; JavaScript &#20195;&#30721;</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#20351;&#29992; // &#20316;&#20026;&#27880;&#37322;&#30340;&#24320;&#22987;</span>
  <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">a</span> = 2;
  alert<span style="color: #707183;">(</span>a<span style="color: #707183;">)</span>;
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>

<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">....</span>
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
</pre>
</div>

<p>
另外:
</p>
<ul class="org-ul">
<li>如果 script 标签不闭合，会导致页面渲染出问题</li>
<li>浏览器渲染 html 是从上到下的，所以，前面的 script 会比后面的先执行</li>
<li>一个页面中可以有多个 script 块</li>
<li>一般来说，会将 script 放到 head 中，但是为了渲染速度，很多时候，会放到 body 的最后</li>
</ul>
</div>
</div>

<div id="outline-container-org6ec6943" class="outline-3">
<h3 id="org6ec6943"><span class="section-number-3">3.2</span> 作为外部的 JS 文件存在</h3>
<div class="outline-text-3" id="text-3-2">
<p>
引入外部 JavaScript 脚本的语法:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#21152;&#36733; html &#25991;&#20214;&#30456;&#21516;&#30446;&#24405;&#30340; hello.js &#25991;&#20214; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"hello.js"</span><span style="color: #707183;">&gt;&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"./hello.js"</span><span style="color: #707183;">&gt;&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>

<span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">/html/aaa/bbb/hello.html </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">/html/js/hello.js </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#38169;&#35823;&#30340;&#31034;&#20363;&#65306; /html/hello.html </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"../../js/hello.js"</span><span style="color: #707183;">&gt;&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>

<span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#32477;&#23545;&#36335;&#24452; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"/html/hello.js"</span><span style="color: #707183;">&gt;&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>

<span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">&#19968;&#23450;&#27880;&#24847;&#65292;&#26631;&#31614;&#35201;&#38381;&#21512;&#12290;&#20808;&#20004;&#31181;&#20889;&#27861;&#37117;&#26159;&#38169;&#35823;&#30340; </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"hello.js"</span><span style="color: #707183;">&gt;</span>
&lt;script src=<span style="color: #8b2252;">"hello.js"</span>/&gt;
</pre>
</div>

<p>
也可以直接使用外部的链接作为 JS 脚本直接使用:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #a020f0;">!doctype</span> html&gt;
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">html</span> <span style="color: #a0522d;">lang</span>=<span style="color: #8b2252;">"en"</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">meta</span> <span style="color: #a0522d;">charset</span>=<span style="color: #8b2252;">"UTF-8"</span>/<span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">title</span><span style="color: #707183;">&gt;</span><span style="font-weight: bold; text-decoration: underline;">&#24341;&#20837;&#22806;&#37096;&#30340; JS</span><span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">title</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"https://cdn.bootcdn.net/ajax/libs/jquery/3.5.1/jquery.min.js"</span><span style="color: #707183;">&gt;&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">body</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
     alert<span style="color: #707183;">(</span>$<span style="color: #707183;">)</span>;
    <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">body</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">html</span><span style="color: #707183;">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1302d04" class="outline-3">
<h3 id="org1302d04"><span class="section-number-3">3.3</span> [示例] 创建一个网页，点击按钮刷新节点的时间</h3>
<div class="outline-text-3" id="text-3-3">
<p>
首先，创建一个网页 aaa.html，确定其中的「内容」和「结构」:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #707183;">&lt;</span><span style="color: #0000ff;">html</span> <span style="color: #a0522d;">lang</span>=<span style="color: #8b2252;">"en"</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">meta</span> <span style="color: #a0522d;">charset</span>=<span style="color: #8b2252;">"UTF-8"</span>/<span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">title</span><span style="color: #707183;">&gt;</span><span style="font-weight: bold; text-decoration: underline;">Time</span><span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">title</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">head</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">body</span><span style="color: #707183;">&gt;</span>
    &#29616;&#22312;&#26102;&#38388;&#26159;:
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">p</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"time_node"</span><span style="color: #707183;">&gt;</span>No time now<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">p</span><span style="color: #707183;">&gt;</span>
    <span style="color: #707183;">&lt;</span><span style="color: #0000ff;">button</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"time_button"</span><span style="color: #707183;">&gt;</span>&#21047;&#26032;&#26102;&#38388;<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">button</span><span style="color: #707183;">&gt;</span>
  <span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">body</span><span style="color: #707183;">&gt;</span>
<span style="color: #707183;">&lt;</span>/<span style="color: #0000ff;">html</span><span style="color: #707183;">&gt;</span>
</pre>
</div>

<p>
其次，添加样式，使用外部 css 文件 aaa.css:
</p>
<div class="org-src-container">
<pre class="src src-css"><span style="color: #0000ff;">p </span><span style="color: #707183;">{</span>
    <span style="color: #a020f0;">color</span>: <span style="color: #ffffff; background-color: #ff0000;">red</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
然后，添加交互逻辑，使用外部 JavaScript 文件 aaa.js:
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">showTime</span> <span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
    node_time.innerText = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Date</span><span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
node_button = showTime;
</pre>
</div>

<p>
最后，确保将 aaa.css 和 aaa.js 添加到 html 中。要注意添加的位置:
</p>
<div class="org-src-container">
<pre class="src src-html">...
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">link</span> <span style="color: #a0522d;">rel</span>=<span style="color: #8b2252;">"stylesheet"</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"hello.css"</span><span style="color: #707183;">&gt;</span>
...
<span style="color: #707183;">&lt;</span><span style="color: #0000ff;">script</span> <span style="color: #a0522d;">src</span>=<span style="color: #8b2252;">"hello.js"</span><span style="color: #707183;">&gt;&lt;</span>/<span style="color: #0000ff;">script</span><span style="color: #707183;">&gt;</span>
...
</pre>
</div>

<hr>

<p>
上述就是编写一个网页的基本流程。
</p>

<p>
将「样式」和「交互逻辑」从页面中 分离 出来，这样结构更加分明，
方便分工协作，而且有益于维护和重构。
</p>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2020-10-28</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
